package taskManager.model.task;

/**
 * Перечисление, представляющее различные статусы задачи.
 * <p>
 * Данное перечисление используется для отслеживания состояния задачи
 * в процессе выполнения. Статусы включают:
 * <p>
 * STATUS_TODO - задача, которая еще не начата;
 * STATUS_IN_PROGRESS - задача, которая в процессе выполнения;
 * STATUS_DONE - задача, которая завершена.
 * <p>
 * Каждый статус имеет соответствующее строковое представление,
 * которое может быть использовано для отображения или логирования.
 */
public enum TaskStatus {
    STATUS_TODO("todo"),
    STATUS_IN_PROGRESS("in progress"),
    STATUS_DONE("done");

    /**
     * Хранит текущее состояние объекта.
     * Значение переменной может использоваться для отслеживания
     * статуса или состояния в процессе выполнения программы.
     */
    private String status;
    TaskStatus(String status) {
        this.status = status;
    }
    public String getStatus() {
        return status;
    }
}
