package seal.libs.redux.utils;

import com.google.gson.Gson;

/**
 * Утилитарный класс для создания глубоких копий объектов.
 * <p>
 * Класс предоставляет метод для клонирования объектов с использованием
 * сериализации и десериализации через библиотеку Gson. Это позволяет
 * создавать независимые копии объектов, включая все вложенные структуры.
 */
@SuppressWarnings("unchecked")
public class CloneUtil {
    private static final Gson gson = new Gson();

    /**
     * Создает глубокую копию переданного объекта.
     * <p>
     * Данный метод использует сериализацию и десериализацию через библиотеку Gson
     * для создания новой инстанции объекта, которая является независимой копией
     * оригинала. Все вложенные объекты также копируются, что обеспечивает полную
     * изоляцию от изменения оригинального объекта.
     *
     * @param object объект, который необходимо клонировать
     * @return глубокая копия переданного объекта
     * @throws NullPointerException если переданный объект равен null
     */
    public static <T> T deepClone(T object) {
        return gson.fromJson(gson.toJson(object), (Class<T>) object.getClass());
    }
}
